blog/_posts/2013-10/2013-10-31-python-conf.html
---
layout: post
keywords: 
description: 
title: python好操作 
categories: [python]
tags: [python,module]
group: archive
icon: code
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 获取脚本路径</a>
<ul>
<li><a href="#sec-1-1">1.1 os.path.dirname</a></li>
</ul>
</li>
<li><a href="#sec-2">2 读取配置文件</a>
<ul>
<li><a href="#sec-2-1">2.1 配置文件node.conf</a></li>
<li><a href="#sec-2-2">2.2 读取配置文件中的IP信息</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">获取脚本路径</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">os.path.dirname</h3>
<div class="outline-text-3" id="text-1-1">

<ol>
<li>当"print os.path.dirname(_<sub>file</sub>__)"所在脚本是以完整路径被运行的，那么将输出该脚本所在的完整路径，比如：
</li>
</ol>




<pre class="src src-python">python d:/pythonSrc/test/test.py
</pre>

<p>
那么将输出 d:/pythonSrc/test
</p><ol>
<li>当"print os.path.dirname(_<sub>file</sub>__)"所在脚本是以相对路径被运行的， 那么将输出空目录，比如：
</li>
</ol>




<pre class="src src-python">python test.py
</pre>

<p>
那么将输出空字符串
</p>
<p>
注意直接在解析器里运行是会报错的
</p>


<pre class="src src-python"><span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#33719;&#21462;&#33050;&#26412;&#32477;&#23545;&#36335;&#24452;</span>
os.path.abspath(os.path.dirname(__file__))
</pre>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">读取配置文件</h2>
<div class="outline-text-2" id="text-2">

<p>用到的模块*ConfigParser*
</p>
</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">配置文件node.conf</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-sh">global]
ip = 192.168.1.100
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">读取配置文件中的IP信息</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="src src-python"><span style="color: #1c86ee;">import</span> ConfigParser
<span style="color: #1c86ee;">import</span> os

<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#33719;&#21462;&#33050;&#26412;&#25152;&#22312;&#32477;&#23545;&#36335;&#24452;</span>
<span style="color: #2e8b57;">localDir</span> = os.path.abspath(os.path.dirname(__file__))

<span style="color: #2e8b57;">config</span> = ConfigParser.ConfigParser()
<span style="color: #2e8b57;">conf</span> = localDir + <span style="color: #8b7355;">"/node.conf"</span>
config.readfp(<span style="color: #cd6600;">open</span>(conf),<span style="color: #8b7355;">"rb"</span>)

<span style="color: #1c86ee;">print</span> config.get(<span style="color: #8b7355;">"global"</span>,<span style="color: #8b7355;">"ip"</span>)
</pre>

</div>
</div>
</div>
